In [1]:
import pandas as pd
import numpy as np

In [2]:
 obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a',
'c'])

In [3]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [4]:
obj2 = obj.reindex(list('abcde'))

In [5]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [6]:
 obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2,
4])

In [7]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [10]:
obj3.reindex(range(5),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
dtype: object

In [11]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
index=['a', 'c', 'd'],
columns=['Ohio', 'Texas',
'California'])

In [12]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [15]:
frame2 = frame.reindex(list('abcd'),method='ffill')

In [16]:
frame2

   Ohio  Texas  California
a     0      1           2
b     0      1           2
c     3      4           5
d     6      7           8

In [17]:
states = ['Texas', 'Utah', 'California']

In [18]:
frame2.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [19]:
t = frame2.reindex(columns=states)

In [20]:
t['a'] =1

In [21]:
t

   Texas  Utah  California  a
a      1   NaN           2  1
b      1   NaN           2  1
c      4   NaN           5  1
d      7   NaN           8  1

In [22]:
frame2

   Ohio  Texas  California
a     0      1           2
b     0      1           2
c     3      4           5
d     6      7           8

In [23]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd',
'e'])

In [24]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [25]:
new_obj = obj.drop('c')

In [26]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [28]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
index=['Ohio', 'Colorado', 'Utah', 'New York'],
columns=['one', 'two', 'three',
'four'])

In [29]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [31]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [32]:
data.drop('two',axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [33]:
data.drop(columns='two')

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [34]:
data.drop(columns='two',inplace=True)

In [36]:
data

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [37]:
 obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [38]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [39]:
obj['b']

1.0

In [40]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [41]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [42]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [43]:
obj['b':'c'] = 5

In [44]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [45]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
index=['Ohio', 'Colorado', 'Utah', 'New York'],
columns=['one', 'two', 'three',
'four'])

In [46]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [47]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [48]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [53]:
data['three'] > 5

Ohio        False
Colorado     True
Utah         True
New York     True
Name: three, dtype: bool

In [54]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [55]:
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [56]:
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [57]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [58]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [59]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    4    5
Utah        11    8    9

In [60]:
 data.loc[:'Utah', 'two']

Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int32

In [64]:
data.iloc[:,:3][data .three < 9]

          one  two  three
Ohio        0    1      2
Colorado    4    5      6

In [62]:
data.iloc[:,:3]

          one  two  three
Ohio        0    1      2
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

In [63]:
[data .three > 5]

[Ohio        False
 Colorado     True
 Utah         True
 New York     True
 Name: three, dtype: bool]

In [65]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [71]:
data.iloc[1,1]

5

In [72]:
ser = pd.Series(np.arange(3.))

In [74]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])

In [75]:
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [76]:
ser2[-1]

2.0

In [78]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [79]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd',
'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],index=['a', 'c', 'e', 'f', 'g'])

In [80]:
s1,s2

(a    7.3
 c   -2.5
 d    3.4
 e    1.5
 dtype: float64, a   -2.1
 c    3.6
 e   -1.5
 f    4.0
 g    3.1
 dtype: float64)

In [81]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [82]:
s1.add(s2,fill_value=0)

a    5.2
c    1.1
d    3.4
e    0.0
f    4.0
g    3.1
dtype: float64

In [83]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)),
columns=list('bcd'),
index=['Ohio', 'Texas', 'Colorado'])

In [84]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)),
columns=list('bde'),
index=['Utah', 'Ohio', 'Texas',
'Oregon'])

In [85]:
df1,df2

(            b    c    d
 Ohio      0.0  1.0  2.0
 Texas     3.0  4.0  5.0
 Colorado  6.0  7.0  8.0,           b     d     e
 Utah    0.0   1.0   2.0
 Ohio    3.0   4.0   5.0
 Texas   6.0   7.0   8.0
 Oregon  9.0  10.0  11.0)

In [86]:
df1.add(df2,fill_value=0)

            b    c     d     e
Colorado  6.0  7.0   8.0   NaN
Ohio      3.0  1.0   6.0   5.0
Oregon    9.0  NaN  10.0  11.0
Texas     9.0  4.0  12.0   8.0
Utah      0.0  NaN   1.0   2.0

In [87]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
columns=list('abcd'))

In [88]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
columns=list('abcde'))

In [89]:
df2.loc[1, 'b'] = np.nan

In [90]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [91]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [92]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [93]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [94]:
1/df1

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

In [95]:
df1.rdiv(1)

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

In [96]:
df1.reindex(columns=df2.columns,fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [97]:
arr = np.arange(12.).reshape((3, 4))

In [98]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [99]:
arr[0]

array([0., 1., 2., 3.])

In [100]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [101]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
columns=list('bde'),
index=['Utah', 'Ohio', 'Texas',
'Oregon'])

In [102]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [105]:
frame - frame.iloc[0]

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [106]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])

In [107]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [108]:
series3 = frame['d']

In [109]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [112]:
frame.sub(series3,axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [114]:
frame.values

array([[ 0.,  1.,  2.],
       [ 3.,  4.,  5.],
       [ 6.,  7.,  8.],
       [ 9., 10., 11.]])

In [115]:
frame = pd.DataFrame(np.random.randn(4, 3),
columns=list('bde'),
index=['Utah', 'Ohio', 'Texas',
'Oregon'])

In [116]:
frame

               b         d         e
Utah    0.461568  1.144868 -0.023796
Ohio   -0.211013 -0.017584  0.775530
Texas   0.354119  0.695202  0.519504
Oregon -1.000656 -0.186399 -0.674042

In [117]:
import numpy as np

In [118]:
np.abs(frame)

               b         d         e
Utah    0.461568  1.144868  0.023796
Ohio    0.211013  0.017584  0.775530
Texas   0.354119  0.695202  0.519504
Oregon  1.000656  0.186399  0.674042

In [119]:
f = lambda x: x.max() - x.min()

In [124]:
frame.apply(f,axis='index')

b    1.462224
d    1.331267
e    1.449572
dtype: float64

In [125]:
f = lambda x: pd.Series([x.min(),x.max()],index=['min','max'])

In [129]:
frame.apply(f,axis=1)

             min       max
Utah   -0.023796  1.144868
Ohio   -0.211013  0.775530
Texas   0.354119  0.695202
Oregon -1.000656 -0.186399

In [132]:
format = lambda i: '%.2f' % i

In [133]:
frame.applymap(format)

            b      d      e
Utah     0.46   1.14  -0.02
Ohio    -0.21  -0.02   0.78
Texas    0.35   0.70   0.52
Oregon  -1.00  -0.19  -0.67

In [134]:
frame['b'].map(format)

Utah       0.46
Ohio      -0.21
Texas      0.35
Oregon    -1.00
Name: b, dtype: object

In [135]:
obj = pd.Series(range(4),index=list('dabc'))

In [136]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [137]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
index=['three', 'one'],
columns=['d', 'a', 'b', 'c'])

In [140]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [141]:
frame.sort_index(axis=1,ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [142]:
obj = pd.Series([4, 7, -3, 2])

In [143]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [144]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [145]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0,
1]})

In [146]:
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [147]:
frame.sort_values(by=['b'])

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [148]:
frame.sort_values(by=['a','b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [158]:
obj = pd.Series([7, -5,-5, 7, 4, 2, 0, 4,4])

In [159]:
obj.rank()

0    8.5
1    1.5
2    1.5
3    8.5
4    6.0
5    4.0
6    3.0
7    6.0
8    6.0
dtype: float64

In [160]:
obj.shape

(9,)

In [156]:
obj.unique().shape

(5,)

In [161]:
obj.rank(method='first')

0    8.0
1    1.0
2    2.0
3    9.0
4    5.0
5    4.0
6    3.0
7    6.0
8    7.0
dtype: float64

In [165]:
obj.rank(ascending=False,method='min')

0    1.0
1    8.0
2    8.0
3    1.0
4    3.0
5    6.0
6    7.0
7    3.0
8    3.0
dtype: float64

In [166]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0,
1],'c': [-2, 5, 8, -2.5]})

In [167]:
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [173]:
frame.rank(axis=0,method = 'dense')

     a    b    c
0  1.0  3.0  2.0
1  2.0  4.0  3.0
2  1.0  1.0  4.0
3  2.0  2.0  1.0

In [174]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [176]:
obj.index.is_unique

False

In [177]:
obj.a

a    0
a    1
dtype: int64

In [178]:
obj.c

4

In [179]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a',
'b', 'b'])

In [181]:
df

          0         1         2
a -0.049437  0.167548  0.475148
a  1.213460  1.225425 -0.999275
b  0.514109 -0.141164 -1.296492
b  1.710104 -0.199271 -0.534090

In [184]:
df.loc['a',:]

          0         1         2
a -0.049437  0.167548  0.475148
a  1.213460  1.225425 -0.999275

In [185]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
[np.nan, np.nan], [0.75, -1.3]],
index=['a', 'b', 'c', 'd'],
columns=['one', 'two'])

In [186]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [187]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [189]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [191]:
df.sum(axis='columns',skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [193]:
df.idxmax(axis=1)

a    one
b    one
c    NaN
d    one
dtype: object

In [194]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [196]:
df.cummax()

   one  two
a  1.4  NaN
b  7.1 -4.5
c  NaN  NaN
d  7.1 -1.3

In [197]:
df.cummin()

    one  two
a  1.40  NaN
b  1.40 -4.5
c   NaN  NaN
d  0.75 -4.5

In [198]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [199]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)

In [200]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [201]:
df.skew()

one    1.664846
two         NaN
dtype: float64

In [202]:
df.diff()

   one  two
a  NaN  NaN
b  5.7  NaN
c  NaN  NaN
d  NaN  NaN

In [204]:
df.fillna(0).diff()

    one  two
a   NaN  NaN
b  5.70 -4.5
c -7.10  4.5
d  0.75 -1.3

In [3]:
import pandas_datareader.data as web
import pandas as pd
all_data = {ticker: web.get_data_yahoo(ticker)
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}
price = pd.DataFrame({ticker: data['Adj Close']
for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']
for ticker, data in all_data.items()})

In [4]:
all_data

{'AAPL':                   High         Low        Open       Close       Volume  \
 Date
 2009-12-31   30.478571   30.080000   30.447144   30.104286   88102700.0
 2010-01-04   30.642857   30.340000   30.490000   30.572857  123432400.0
 2010-01-05   30.798571   30.464285   30.657143   30.625713  150476200.0
 2010-01-06   30.747143   30.107143   30.625713   30.138571  138040000.0
 2010-01-07   30.285715   29.864286   30.250000   30.082857  119282800.0
 2010-01-08   30.285715   29.865715   30.042856   30.282858  111902700.0
 2010-01-11   30.428572   29.778572   30.400000   30.015715  115557400.0
 2010-01-12   29.967142   29.488571   29.884285   29.674286  148614900.0
 2010-01-13   30.132856   29.157143   29.695715   30.092857  151473000.0
 2010-01-14   30.065714   29.860001   30.015715   29.918571  108223500.0
 2010-01-15   30.228571   29.410000   30.132856   29.418571  148516900.0
 2010-01-19   30.741428   29.605715   29.761429   30.719999  182501900.0
 2010-01-20   30.792856   29.928572   30.701429   30.247143  153038200.0
 2010-01-21   30.472857   29.601429   30.297142   29.724285  152038600.0
 2010-01-22   29.642857   28.165714   29.540001   28.250000  220441900.0
 2010-01-25   29.242857   28.598572   28.930000   29.010000  266424900.0
 2010-01-26   30.530001   28.940001   29.421429   29.420000  466777500.0
 2010-01-27   30.082857   28.504286   29.549999   29.697144  430642100.0
 2010-01-28   29.357143   28.385714   29.275715   28.469999  293375600.0
 2010-01-29   28.885714   27.178572   28.725714   27.437143  311488100.0
 2010-02-01   28.000000   27.328571   27.481428   27.818571  187469100.0
 2010-02-02   28.045713   27.625713   27.987143   27.980000  174585600.0
 2010-02-03   28.600000   27.774286   27.881428   28.461428  153832000.0
 2010-02-04   28.338572   27.367144   28.104286   27.435715  189413000.0
 2010-02-05   28.000000   27.264286   27.518572   27.922857  212576700.0
 2010-02-08   28.268572   27.714285   27.955715   27.731428  119567700.0
 2010-02-09   28.214285   27.821428   28.059999   28.027143  158221700.0
 2010-02-10   28.085714   27.751429   27.984285   27.874287   92590400.0
 2010-02-11   28.535715   27.722857   27.840000   28.381428  137586400.0
 2010-02-12   28.805714   27.928572   28.301428   28.625713  163867200.0
 ...                ...         ...         ...         ...          ...
 2019-01-17  157.660004  153.259995  154.199997  155.860001   29821200.0
 2019-01-18  157.880005  155.979996  157.500000  156.820007   33751000.0
 2019-01-22  156.729996  152.619995  156.410004  153.300003   30394000.0
 2019-01-23  155.139999  151.699997  154.149994  153.919998   23130600.0
 2019-01-24  154.479996  151.740005  154.110001  152.699997   25441500.0
 2019-01-25  158.130005  154.320007  155.479996  157.759995   33535500.0
 2019-01-28  156.330002  153.660004  155.789993  156.300003   26192100.0
 2019-01-29  158.130005  154.110001  156.250000  154.679993   41587200.0
 2019-01-30  166.149994  160.229996  163.250000  165.250000   61109800.0
 2019-01-31  169.000000  164.559998  166.110001  166.440002   40739600.0
 2019-02-01  168.979996  165.929993  166.960007  166.520004   32668100.0
 2019-02-04  171.660004  167.279999  167.410004  171.250000   31495500.0
 2019-02-05  175.080002  172.350006  172.860001  174.179993   36101600.0
 2019-02-06  175.570007  172.850006  174.649994  174.240005   28239600.0
 2019-02-07  173.940002  170.339996  172.399994  170.940002   31741700.0
 2019-02-08  170.660004  168.419998  168.990005  170.410004   23820000.0
 2019-02-11  171.210007  169.250000  171.050003  169.429993   20993400.0
 2019-02-12  171.000000  169.699997  170.100006  170.889999   22283500.0
 2019-02-13  172.479996  169.919998  171.389999  170.179993   22490200.0
 2019-02-14  171.259995  169.380005  169.710007  170.800003   21835700.0
 2019-02-15  171.699997  169.750000  171.250000  170.419998   24626800.0
 2019-02-19  171.440002  169.490005  169.710007  170.929993   18972800.0
 2019-02-20  173.320007  170.990005  171.190002  172.029999   26114400.0
 2019-02-21  172.369995  170.300003  171.800003  171.059998   17249700.0
 2019-02-22  173.000000  171.380005  171.580002  172.970001   18913200.0
 2019-02-25  175.869995  173.949997  174.160004  174.229996   21873400.0
 2019-02-26  175.300003  173.169998  173.710007  174.330002   17070200.0
 2019-02-27  175.000000  172.729996  173.210007  174.869995   27835400.0
 2019-02-28  174.910004  172.919998  174.320007  173.149994   28215400.0
 2019-03-01  175.149994  172.889999  174.279999  174.970001   25873500.0

              Adj Close
 Date
 2009-12-31   20.073631
 2010-01-04   20.386072
 2010-01-05   20.421322
 2010-01-06   20.096491
 2010-01-07   20.059338
 2010-01-08   20.192701
 2010-01-11   20.014568
 2010-01-12   19.786903
 2010-01-13   20.066006
 2010-01-14   19.949797
 2010-01-15   19.616390
 2010-01-19   20.484186
 2010-01-20   20.168890
 2010-01-21   19.820242
 2010-01-22   18.837185
 2010-01-25   19.343958
 2010-01-26   19.617346
 2010-01-27   19.802147
 2010-01-28   18.983883
 2010-01-29   18.295170
 2010-02-01   18.549507
 2010-02-02   18.657150
 2010-02-03   18.978167
 2010-02-04   18.294220
 2010-02-05   18.619045
 2010-02-08   18.491404
 2010-02-09   18.688580
 2010-02-10   18.586657
 2010-02-11   18.924822
 2010-02-12   19.087709
 ...                ...
 2019-01-17  155.194397
 2019-01-18  156.150314
 2019-01-22  152.645340
 2019-01-23  153.262680
 2019-01-24  152.047897
 2019-01-25  157.086288
 2019-01-28  155.632523
 2019-01-29  154.019440
 2019-01-30  164.544296
 2019-01-31  165.729218
 2019-02-01  165.808884
 2019-02-04  170.518677
 2019-02-05  173.436157
 2019-02-06  173.495911
 2019-02-07  170.210007
 2019-02-08  170.410004
 2019-02-11  169.429993
 2019-02-12  170.889999
 2019-02-13  170.179993
 2019-02-14  170.800003
 2019-02-15  170.419998
 2019-02-19  170.929993
 2019-02-20  172.029999
 2019-02-21  171.059998
 2019-02-22  172.970001
 2019-02-25  174.229996
 2019-02-26  174.330002
 2019-02-27  174.869995
 2019-02-28  173.149994
 2019-03-01  174.970001

 [2306 rows x 6 columns],
 'GOOG':                    High          Low         Open        Close      Volume  \
 Date
 2009-12-31   310.679321   307.986847   310.356445   307.986847   2455400.0
 2010-01-04   312.721039   310.103088   311.449310   311.349976   3937800.0
 2010-01-05   311.891449   308.761810   311.563568   309.978882   6048500.0
 2010-01-06   310.907837   301.220856   310.907837   302.164703   8009000.0
 2010-01-07   303.029083   294.410156   302.731018   295.130463  12912000.0
 2010-01-08   299.675903   292.651581   294.087250   299.064880   9509900.0
 2010-01-11   300.276978   295.100647   300.276978   298.612823  14519600.0
 2010-01-12   297.147339   292.100159   296.893982   293.332153   9769600.0
 2010-01-13   292.288940   285.095734   286.382355   291.648102  13077600.0
 2010-01-14   295.180145   289.521942   290.063416   293.019196   8535300.0
 2010-01-15   294.862213   287.152344   294.752930   288.126007  10939600.0
 2010-01-19   293.302338   286.283020   288.722137   291.911407   8689500.0
 2010-01-20   291.096710   285.786224   291.096710   288.329681   6543600.0
 2010-01-21   291.513977   284.276062   289.834900   289.606384  12697400.0
 2010-01-22   283.456390   265.701874   280.426086   273.227905  13689200.0
 2010-01-25   273.163330   266.024780   271.528961   268.255249   8897200.0
 2010-01-26   273.024231   266.412231   267.246826   269.457428   8767600.0
 2010-01-27   272.055542   265.925415   268.886169   269.298462   7980200.0
 2010-01-28   271.732635   263.585632   270.485748   265.418701   6500100.0
 2010-01-29   268.747070   261.106750   267.505127   263.257751   8334700.0
 2010-02-01   266.173798   263.436584   265.572693   264.787811   4530800.0
 2010-02-02   265.751556   262.100281   265.751556   263.843964   8245600.0
 2010-02-03   269.298462   262.408295   262.626862   268.662598   6037000.0
 2010-02-04   267.261719   261.081909   266.764954   261.687958   6799200.0
 2010-02-05   265.026245   259.541931   262.492737   263.928406   6353000.0
 2010-02-08   269.248810   264.047638   264.529480   265.011353   5423500.0
 2010-02-09   269.015320   265.806183   268.026733   266.486755   5675700.0
 2010-02-10   267.157410   262.140045   265.309418   265.498199   5383700.0
 2010-02-11   268.498688   263.039185   264.936829   266.466888   4851300.0
 2010-02-12   266.839478   263.535950   264.762970   264.837494   4589000.0
 ...                 ...          ...          ...          ...         ...
 2019-01-17  1091.800049  1073.500000  1079.469971  1089.900024   1242700.0
 2019-01-18  1108.352051  1090.900024  1100.000000  1098.260010   1955600.0
 2019-01-22  1091.510010  1063.469971  1088.000000  1070.520020   1613500.0
 2019-01-23  1084.930054  1059.750000  1077.349976  1075.569946    967000.0
 2019-01-24  1079.474976  1060.699951  1076.479980  1073.900024   1361300.0
 2019-01-25  1094.000000  1081.819946  1085.000000  1090.989990   1119100.0
 2019-01-28  1083.000000  1063.800049  1080.109985  1070.079956   1284300.0
 2019-01-29  1075.150024  1055.864990  1072.680054  1060.619995   1021800.0
 2019-01-30  1091.000000  1066.849976  1068.430054  1089.060059   1279800.0
 2019-01-31  1117.329956  1095.410034  1103.000000  1116.369995   1538300.0
 2019-02-01  1125.000000  1104.890015  1112.400024  1110.750000   1462200.0
 2019-02-04  1132.800049  1109.020020  1112.660034  1132.800049   2576500.0
 2019-02-05  1146.849976  1117.248047  1124.839966  1145.989990   3552200.0
 2019-02-06  1147.000000  1112.770020  1139.569946  1115.229980   2105600.0
 2019-02-07  1104.839966  1086.000000  1104.160034  1098.709961   2044800.0
 2019-02-08  1098.910034  1086.550049  1087.000000  1095.060059   1075800.0
 2019-02-11  1105.944946  1092.859985  1096.949951  1095.010010   1065200.0
 2019-02-12  1125.295044  1105.849976  1106.800049  1121.369995   1609100.0
 2019-02-13  1134.729980  1118.500000  1124.989990  1120.160034   1049800.0
 2019-02-14  1128.229980  1110.444946  1118.050049  1121.670044    947600.0
 2019-02-15  1131.670044  1110.650024  1130.079956  1113.650024   1449800.0
 2019-02-19  1121.890015  1110.000000  1110.000000  1118.560059   1046400.0
 2019-02-20  1123.410034  1105.280029  1119.989990  1113.800049   1087800.0
 2019-02-21  1111.939941  1092.520020  1110.839966  1096.969971   1415100.0
 2019-02-22  1111.239990  1095.599976  1100.900024  1110.369995   1049500.0
 2019-02-25  1118.540039  1107.270020  1116.000000  1109.400024   1413100.0
 2019-02-26  1119.510010  1099.920044  1105.750000  1115.130005   1471300.0
 2019-02-27  1117.979980  1101.000000  1106.949951  1116.050049    968400.0
 2019-02-28  1127.650024  1111.010010  1111.300049  1119.920044   1542500.0
 2019-03-01  1142.969971  1124.750000  1124.900024  1140.989990   1449800.0

               Adj Close
 Date
 2009-12-31   307.986847
 2010-01-04   311.349976
 2010-01-05   309.978882
 2010-01-06   302.164703
 2010-01-07   295.130463
 2010-01-08   299.064880
 2010-01-11   298.612823
 2010-01-12   293.332153
 2010-01-13   291.648102
 2010-01-14   293.019196
 2010-01-15   288.126007
 2010-01-19   291.911407
 2010-01-20   288.329681
 2010-01-21   289.606384
 2010-01-22   273.227905
 2010-01-25   268.255249
 2010-01-26   269.457428
 2010-01-27   269.298462
 2010-01-28   265.418701
 2010-01-29   263.257751
 2010-02-01   264.787811
 2010-02-02   263.843964
 2010-02-03   268.662598
 2010-02-04   261.687958
 2010-02-05   263.928406
 2010-02-08   265.011353
 2010-02-09   266.486755
 2010-02-10   265.498199
 2010-02-11   266.466888
 2010-02-12   264.837494
 ...                 ...
 2019-01-17  1089.900024
 2019-01-18  1098.260010
 2019-01-22  1070.520020
 2019-01-23  1075.569946
 2019-01-24  1073.900024
 2019-01-25  1090.989990
 2019-01-28  1070.079956
 2019-01-29  1060.619995
 2019-01-30  1089.060059
 2019-01-31  1116.369995
 2019-02-01  1110.750000
 2019-02-04  1132.800049
 2019-02-05  1145.989990
 2019-02-06  1115.229980
 2019-02-07  1098.709961
 2019-02-08  1095.060059
 2019-02-11  1095.010010
 2019-02-12  1121.369995
 2019-02-13  1120.160034
 2019-02-14  1121.670044
 2019-02-15  1113.650024
 2019-02-19  1118.560059
 2019-02-20  1113.800049
 2019-02-21  1096.969971
 2019-02-22  1110.369995
 2019-02-25  1109.400024
 2019-02-26  1115.130005
 2019-02-27  1116.050049
 2019-02-28  1119.920044
 2019-03-01  1140.989990

 [2306 rows x 6 columns],
 'IBM':                   High         Low        Open       Close      Volume  \
 Date
 2009-12-31  132.850006  130.750000  132.410004  130.899994   4223400.0
 2010-01-04  132.970001  130.850006  131.179993  132.449997   6155300.0
 2010-01-05  131.850006  130.100006  131.679993  130.850006   6841400.0
 2010-01-06  131.490005  129.809998  130.679993  130.000000   5605300.0
 2010-01-07  130.250000  128.910004  129.869995  129.550003   5840600.0
 2010-01-08  130.919998  129.050003  129.070007  130.850006   4197200.0
 2010-01-11  131.059998  128.669998  131.059998  129.479996   5730400.0
 2010-01-12  131.330002  129.000000  129.029999  130.509995   8081500.0
 2010-01-13  131.119995  129.160004  130.389999  130.229996   6455400.0
 2010-01-14  132.710007  129.910004  130.550003  132.309998   7111800.0
 2010-01-15  132.889999  131.089996  132.029999  131.779999   8494400.0
 2010-01-19  134.250000  131.559998  131.630005  134.139999  13916200.0
 2010-01-20  131.149994  128.949997  130.460007  130.250000  15197500.0
 2010-01-21  130.690002  128.059998  130.470001  129.000000   9608600.0
 2010-01-22  128.889999  125.370003  128.669998  125.500000  10088600.0
 2010-01-25  126.889999  125.709999  126.330002  126.120003   5738500.0
 2010-01-26  127.750000  125.410004  125.919998  125.750000   7135300.0
 2010-01-27  126.959999  125.040001  125.820000  126.330002   8719200.0
 2010-01-28  127.040001  123.050003  127.029999  123.750000   9622200.0
 2010-01-29  125.000000  121.900002  124.320000  122.389999  11571200.0
 2010-02-01  124.949997  122.779999  123.230003  124.669998   7242900.0
 2010-02-02  125.809998  123.949997  124.790001  125.529999   5899900.0
 2010-02-03  126.070000  125.070000  125.160004  125.660004   4177100.0
 2010-02-04  125.440002  122.900002  125.190002  123.000000   9126900.0
 2010-02-05  123.720001  121.830002  123.040001  123.519997   8617000.0
 2010-02-08  123.220001  121.739998  123.150002  121.879997   5718500.0
 2010-02-09  124.199997  122.459999  122.650002  123.209999   6044500.0
 2010-02-10  123.650002  122.209999  122.940002  122.809998   5219100.0
 2010-02-11  124.199997  122.059998  122.580002  123.730003   5089000.0
 2010-02-12  124.050003  121.610001  123.010002  124.000000   8017700.0
 ...                ...         ...         ...         ...         ...
 2019-01-17  122.410004  120.550003  120.559998  122.190002   5029900.0
 2019-01-18  124.720001  122.709999  123.269997  123.820000   6008500.0
 2019-01-22  123.800003  121.540001  123.300003  122.519997  10052400.0
 2019-01-23  135.000000  130.309998  131.369995  132.889999  22063700.0
 2019-01-24  133.210007  131.429993  132.630005  132.529999   6322900.0
 2019-01-25  134.440002  132.429993  132.869995  133.970001   5707400.0
 2019-01-28  134.809998  132.580002  133.100006  134.270004   5357700.0
 2019-01-29  135.410004  133.600006  134.289993  134.330002   5037100.0
 2019-01-30  135.029999  133.250000  134.000000  134.380005   4500900.0
 2019-01-31  134.720001  133.740005  134.449997  134.419998   4884000.0
 2019-02-01  135.199997  133.350006  134.970001  134.100006   3806000.0
 2019-02-04  135.199997  132.990005  134.020004  135.190002   3966600.0
 2019-02-05  135.820007  134.919998  135.279999  135.550003   5398900.0
 2019-02-06  136.649994  135.169998  135.220001  136.320007   4879700.0
 2019-02-07  134.470001  132.119995  133.550003  133.190002   4379400.0
 2019-02-08  133.710007  132.190002  132.339996  133.710007   3249800.0
 2019-02-11  135.149994  133.910004  134.289993  133.990005   3095100.0
 2019-02-12  136.199997  134.860001  135.149994  136.050003   3317200.0
 2019-02-13  137.919998  136.410004  136.919998  137.520004   4253000.0
 2019-02-14  137.600006  136.210007  137.169998  136.479996   2789400.0
 2019-02-15  138.190002  137.389999  137.580002  138.029999   3844100.0
 2019-02-19  138.699997  137.360001  137.809998  138.699997   3385700.0
 2019-02-20  139.240005  137.220001  138.759995  138.000000   3802000.0
 2019-02-21  138.350006  137.350006  137.820007  137.839996   2937300.0
 2019-02-22  139.380005  138.429993  138.729996  139.250000   3113700.0
 2019-02-25  140.470001  139.320007  140.000000  139.460007   3194200.0
 2019-02-26  140.490005  139.470001  139.669998  139.720001   3060400.0
 2019-02-27  139.570007  138.399994  139.250000  139.169998   2530900.0
 2019-02-28  139.059998  137.720001  138.770004  138.130005   3457800.0
 2019-03-01  140.039993  138.639999  139.309998  139.199997   2979600.0

              Adj Close
 Date
 2009-12-31   99.303009
 2010-01-04  100.478867
 2010-01-05   99.265091
 2010-01-06   98.620255
 2010-01-07   98.278870
 2010-01-08   99.265091
 2010-01-11   98.225777
 2010-01-12   99.007156
 2010-01-13   98.794746
 2010-01-14  100.372673
 2010-01-15   99.970589
 2010-01-19  101.760918
 2010-01-20   98.809929
 2010-01-21   97.861649
 2010-01-22   95.206505
 2010-01-25   95.676834
 2010-01-26   95.396156
 2010-01-27   95.836143
 2010-01-28   93.878906
 2010-01-29   92.847176
 2010-02-01   94.576828
 2010-02-02   95.229240
 2010-02-03   95.327866
 2010-02-04   93.309929
 2010-02-05   93.704422
 2010-02-08   92.873825
 2010-02-09   93.887291
 2010-02-10   93.582497
 2010-02-11   94.283569
 2010-02-12   94.489265
 ...                ...
 2019-01-17  120.782738
 2019-01-18  122.393959
 2019-01-22  121.108925
 2019-01-23  131.359497
 2019-01-24  131.003647
 2019-01-25  132.427063
 2019-01-28  132.723618
 2019-01-29  132.782913
 2019-01-30  132.832336
 2019-01-31  132.871872
 2019-02-01  132.555573
 2019-02-04  133.633011
 2019-02-05  133.988861
 2019-02-06  134.750000
 2019-02-07  133.190002
 2019-02-08  133.710007
 2019-02-11  133.990005
 2019-02-12  136.050003
 2019-02-13  137.520004
 2019-02-14  136.479996
 2019-02-15  138.029999
 2019-02-19  138.699997
 2019-02-20  138.000000
 2019-02-21  137.839996
 2019-02-22  139.250000
 2019-02-25  139.460007
 2019-02-26  139.720001
 2019-02-27  139.169998
 2019-02-28  138.130005
 2019-03-01  139.199997

 [2306 rows x 6 columns],
 'MSFT':                   High         Low        Open       Close       Volume  \
 Date
 2009-12-31   30.990000   30.480000   30.980000   30.480000   31929700.0
 2010-01-04   31.100000   30.590000   30.620001   30.950001   38409100.0
 2010-01-05   31.100000   30.639999   30.850000   30.959999   49749600.0
 2010-01-06   31.080000   30.520000   30.879999   30.770000   58182400.0
 2010-01-07   30.700001   30.190001   30.629999   30.450001   50559700.0
 2010-01-08   30.879999   30.240000   30.280001   30.660000   51197400.0
 2010-01-11   30.760000   30.120001   30.709999   30.270000   68754700.0
 2010-01-12   30.400000   29.910000   30.150000   30.070000   65912100.0
 2010-01-13   30.520000   30.010000   30.260000   30.350000   51863500.0
 2010-01-14   31.100000   30.260000   30.309999   30.959999   63228100.0
 2010-01-15   31.240000   30.709999   31.080000   30.860001   79913200.0
 2010-01-19   31.240000   30.680000   30.750000   31.100000   46575700.0
 2010-01-20   30.940001   30.309999   30.809999   30.590000   54849500.0
 2010-01-21   30.719999   30.000000   30.610001   30.010000   73086700.0
 2010-01-22   30.200001   28.840000   30.000000   28.959999  102004600.0
 2010-01-25   29.660000   29.100000   29.240000   29.320000   63373000.0
 2010-01-26   29.850000   29.090000   29.200001   29.500000   66639900.0
 2010-01-27   29.820000   29.020000   29.350000   29.670000   63949500.0
 2010-01-28   29.870001   28.889999   29.840000   29.160000  117513700.0
 2010-01-29   29.920000   27.660000   29.900000   28.180000  193888500.0

In [6]:
price.pct_change()

                AAPL      GOOG       IBM      MSFT
Date
2009-12-31       NaN       NaN       NaN       NaN
2010-01-04  0.015565  0.010920  0.011841  0.015420
2010-01-05  0.001729 -0.004404 -0.012080  0.000323
2010-01-06 -0.015906 -0.025209 -0.006496 -0.006137
2010-01-07 -0.001849 -0.023279 -0.003462 -0.010400
2010-01-08  0.006648  0.013331  0.010035  0.006897
2010-01-11 -0.008822 -0.001512 -0.010470 -0.012720
2010-01-12 -0.011375 -0.017684  0.007955 -0.006607
2010-01-13  0.014105 -0.005741 -0.002145  0.009312
2010-01-14 -0.005791  0.004701  0.015972  0.020099
2010-01-15 -0.016712 -0.016699 -0.004006 -0.003230
2010-01-19  0.044238  0.013138  0.017909  0.007777
2010-01-20 -0.015392 -0.012270 -0.028999 -0.016399
2010-01-21 -0.017286  0.004428 -0.009597 -0.018960
2010-01-22 -0.049599 -0.056554 -0.027132 -0.034988
2010-01-25  0.026903 -0.018200  0.004940  0.012431
2010-01-26  0.014133  0.004481 -0.002934  0.006139
2010-01-27  0.009420 -0.000590  0.004612  0.005763
2010-01-28 -0.041322 -0.014407 -0.020423 -0.017190
2010-01-29 -0.036279 -0.008142 -0.010990 -0.033608
2010-02-01  0.013902  0.005812  0.018629  0.008162
2010-02-02  0.005803 -0.003565  0.006898  0.001760
2010-02-03  0.017206  0.018263  0.001036  0.005973
2010-02-04 -0.036039 -0.025961 -0.021168 -0.027593
2010-02-05  0.017756  0.008562  0.004228  0.006466
2010-02-08 -0.006855  0.004103 -0.008864 -0.010707
2010-02-09  0.010663  0.005567  0.010912  0.010462
2010-02-10 -0.005454 -0.003710 -0.003246 -0.000714
2010-02-11  0.018194  0.003649  0.007491  0.004645
2010-02-12  0.008607 -0.006115  0.002182 -0.006757
...              ...       ...       ...       ...
2019-01-17  0.005938  0.008261  0.004687  0.007022
2019-01-18  0.006159  0.007670  0.013340  0.014983
2019-01-22 -0.022446 -0.025258 -0.010499 -0.018847
2019-01-23  0.004044  0.004717  0.084639  0.009746
2019-01-24 -0.007926 -0.001553 -0.002709 -0.004779
2019-01-25  0.033137  0.015914  0.010865  0.009134
2019-01-28 -0.009255 -0.019166  0.002239 -0.019502
2019-01-29 -0.010365 -0.008840  0.000447 -0.020365
2019-01-30  0.068335  0.026815  0.000372  0.033418
2019-01-31  0.007201  0.025077  0.000298 -0.018330
2019-02-01  0.000481 -0.005034 -0.002380 -0.015800
2019-02-04  0.028405  0.019851  0.008128  0.028799
2019-02-05  0.017109  0.011644  0.002663  0.013997
2019-02-06  0.000345 -0.026841  0.005681 -0.011099
2019-02-07 -0.018939 -0.014813 -0.011577 -0.007168
2019-02-08  0.001175 -0.003322  0.003904  0.003800
2019-02-11 -0.005751 -0.000046  0.002094 -0.003975
2019-02-12  0.008617  0.024073  0.015374  0.015582
2019-02-13 -0.004155 -0.001079  0.010805 -0.000748
2019-02-14  0.003643  0.001348 -0.007563  0.000843
2019-02-15 -0.002225 -0.007150  0.011357  0.012348
2019-02-19  0.002993  0.004409  0.004854 -0.000462
2019-02-20  0.006435 -0.004255 -0.005047 -0.005199
2019-02-21 -0.005639 -0.015111 -0.001159  0.021092
2019-02-22  0.011166  0.012215  0.010229  0.014258
2019-02-25  0.007284 -0.000874  0.001508  0.005587
2019-02-26  0.000574  0.005165  0.001864  0.006900
2019-02-27  0.003098  0.000825 -0.003936 -0.001691
2019-02-28 -0.009836  0.003468 -0.007473 -0.001248
2019-03-01  0.010511  0.018814  0.007746  0.004463

[2306 rows x 4 columns]

In [7]:
returns = price.pct_change()

In [8]:
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2019-02-25  0.007284 -0.000874  0.001508  0.005587
2019-02-26  0.000574  0.005165  0.001864  0.006900
2019-02-27  0.003098  0.000825 -0.003936 -0.001691
2019-02-28 -0.009836  0.003468 -0.007473 -0.001248
2019-03-01  0.010511  0.018814  0.007746  0.004463

In [9]:
returns['MSFT'].corr(returns['IBM'])

0.48668310978790741

In [10]:
returns['MSFT'].cov(returns['IBM'])

8.7347189057950138e-05

In [11]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.457481  0.372080  0.450247
GOOG  0.457481  1.000000  0.408324  0.537512
IBM   0.372080  0.408324  1.000000  0.486683
MSFT  0.450247  0.537512  0.486683  1.000000

In [12]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000271  0.000116  0.000076  0.000108
GOOG  0.000116  0.000238  0.000078  0.000121
IBM   0.000076  0.000078  0.000153  0.000087
MSFT  0.000108  0.000121  0.000087  0.000211

In [13]:
returns.corrwith(returns.IBM)

AAPL    0.372080
GOOG    0.408324
IBM     1.000000
MSFT    0.486683
dtype: float64

In [14]:
volume

                   AAPL        GOOG         IBM         MSFT
Date
2009-12-31   88102700.0   2455400.0   4223400.0   31929700.0
2010-01-04  123432400.0   3937800.0   6155300.0   38409100.0
2010-01-05  150476200.0   6048500.0   6841400.0   49749600.0
2010-01-06  138040000.0   8009000.0   5605300.0   58182400.0
2010-01-07  119282800.0  12912000.0   5840600.0   50559700.0
2010-01-08  111902700.0   9509900.0   4197200.0   51197400.0
2010-01-11  115557400.0  14519600.0   5730400.0   68754700.0
2010-01-12  148614900.0   9769600.0   8081500.0   65912100.0
2010-01-13  151473000.0  13077600.0   6455400.0   51863500.0
2010-01-14  108223500.0   8535300.0   7111800.0   63228100.0
2010-01-15  148516900.0  10939600.0   8494400.0   79913200.0
2010-01-19  182501900.0   8689500.0  13916200.0   46575700.0
2010-01-20  153038200.0   6543600.0  15197500.0   54849500.0
2010-01-21  152038600.0  12697400.0   9608600.0   73086700.0
2010-01-22  220441900.0  13689200.0  10088600.0  102004600.0
2010-01-25  266424900.0   8897200.0   5738500.0   63373000.0
2010-01-26  466777500.0   8767600.0   7135300.0   66639900.0
2010-01-27  430642100.0   7980200.0   8719200.0   63949500.0
2010-01-28  293375600.0   6500100.0   9622200.0  117513700.0
2010-01-29  311488100.0   8334700.0  11571200.0  193888500.0
2010-02-01  187469100.0   4530800.0   7242900.0   85931100.0
2010-02-02  174585600.0   8245600.0   5899900.0   54413700.0
2010-02-03  153832000.0   6037000.0   4177100.0   61397900.0
2010-02-04  189413000.0   6799200.0   9126900.0   77850000.0
2010-02-05  212576700.0   6353000.0   8617000.0   80960100.0
2010-02-08  119567700.0   5423500.0   5718500.0   52820600.0
2010-02-09  158221700.0   5675700.0   6044500.0   59195800.0
2010-02-10   92590400.0   5383700.0   5219100.0   48591300.0
2010-02-11  137586400.0   4851300.0   5089000.0   65993700.0
2010-02-12  163867200.0   4589000.0   8017700.0   81117200.0
...                 ...         ...         ...          ...
2019-01-17   29821200.0   1242700.0   5029900.0   28393000.0
2019-01-18   33751000.0   1955600.0   6008500.0   37427600.0
2019-01-22   30394000.0   1613500.0  10052400.0   32371300.0
2019-01-23   23130600.0    967000.0  22063700.0   25874300.0
2019-01-24   25441500.0   1361300.0   6322900.0   23164800.0
2019-01-25   33535500.0   1119100.0   5707400.0   31225600.0
2019-01-28   26192100.0   1284300.0   5357700.0   29476700.0
2019-01-29   41587200.0   1021800.0   5037100.0   31490500.0
2019-01-30   61109800.0   1279800.0   4500900.0   49471900.0
2019-01-31   40739600.0   1538300.0   4884000.0   55636400.0
2019-02-01   32668100.0   1462200.0   3806000.0   35535700.0
2019-02-04   31495500.0   2576500.0   3966600.0   31315100.0
2019-02-05   36101600.0   3552200.0   5398900.0   27325400.0
2019-02-06   28239600.0   2105600.0   4879700.0   20609800.0
2019-02-07   31741700.0   2044800.0   4379400.0   29760700.0
2019-02-08   23820000.0   1075800.0   3249800.0   21461100.0
2019-02-11   20993400.0   1065200.0   3095100.0   18914100.0
2019-02-12   22283500.0   1609100.0   3317200.0   25056600.0
2019-02-13   22490200.0   1049800.0   4253000.0   18394900.0
2019-02-14   21835700.0    947600.0   2789400.0   21784700.0
2019-02-15   24626800.0   1449800.0   3844100.0   26606900.0
2019-02-19   18972800.0   1046400.0   3385700.0   18038500.0
2019-02-20   26114400.0   1087800.0   3802000.0   21607700.0
2019-02-21   17249700.0   1415100.0   2937300.0   29063200.0
2019-02-22   18913200.0   1049500.0   3113700.0   27763200.0
2019-02-25   21873400.0   1413100.0   3194200.0   23750600.0
2019-02-26   17070200.0   1471300.0   3060400.0   21536700.0
2019-02-27   27835400.0    968400.0   2530900.0   21487100.0
2019-02-28   28215400.0   1542500.0   3457800.0   29083900.0
2019-03-01   25873500.0   1449800.0   2979600.0   20827800.0

[2306 rows x 4 columns]

In [17]:
returns.corrwith(volume,axis=0)

AAPL   -0.059732
GOOG   -0.017377
IBM    -0.153277
MSFT   -0.089666
dtype: float64

In [18]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c',
'c'])

In [19]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [20]:
uniques = obj.unique()

In [21]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [22]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [27]:
pd.value_counts(obj,sort=True)

c    3
a    3
b    2
d    1
dtype: int64

In [28]:
mask = obj.isin(['b','c'])

In [29]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [30]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [31]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])

In [32]:
unique_vals = pd.Series(['c', 'b', 'a'])

In [34]:
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [35]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
'Qu2': [2, 3, 1, 2, 3],
'Qu3': [1, 5, 2, 4, 4]})

In [36]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [37]:
result = data.apply(pd.value_counts).fillna(0)

In [38]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0